# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
number = input("Введите трехзначное число: ")
a = int(number[0])
b = int(number[1])
c = int(number[2])
print(a+b+c)
print(a*b*c)

